# Series

In [244]:
# len(data) should be equal to len(index)

In [245]:
import numpy as np

In [246]:
import pandas as pd

In [247]:
labels = ['a','b','c']

In [248]:
my_data = [10,20,30]

In [249]:
arr = np.array(my_data)

In [250]:
arr

array([10, 20, 30])

In [251]:
d = {'a':10,'b':20,'c':30}

In [252]:
d

{'a': 10, 'b': 20, 'c': 30}

In [253]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [254]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [255]:
pd.Series(data = d)

a    10
b    20
c    30
dtype: int64

In [256]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [257]:
pd.Series(data=labels,index=my_data)

10    a
20    b
30    c
dtype: object

In [258]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [259]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [260]:
pd.Series(my_data,my_data)

10    10
20    20
30    30
dtype: int64

In [261]:
pd.Series(d,labels) - pd.Series(d)*2

a   -10
b   -20
c   -30
dtype: int64

In [262]:
arr1 = np.arange(0,2)

In [263]:
pd.Series(arr1)

0    0
1    1
dtype: int32

In [264]:
my_list1 = [1,2,3,4]
arr2 = np.array(my_list1)

In [265]:
arr2

array([1, 2, 3, 4])

In [266]:
pd.Series(arr2)

0    1
1    2
2    3
3    4
dtype: int32

In [267]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [268]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [269]:
ser1 = pd.Series([1,2,3,4],['Mercedes','RBR','Renault','Ferrari'])

In [270]:
ser1

Mercedes    1
RBR         2
Renault     3
Ferrari     4
dtype: int64

In [271]:
ser2 = pd.Series([1,2,5,4],['Mercedes','RBR','Racing Point','Ferrari'])

In [272]:
ser2

Mercedes        1
RBR             2
Racing Point    5
Ferrari         4
dtype: int64

In [273]:
ser1['Mercedes']

1

In [274]:
num1 = ser1[ser1[ser2[ser1['Mercedes']]]]-1

In [275]:
ser2[num1]

4

In [276]:
ser1 + ser2

Ferrari         8.0
Mercedes        2.0
RBR             4.0
Racing Point    NaN
Renault         NaN
dtype: float64

# DataFrames

In [277]:
import numpy as np
import pandas as pd

In [278]:
from numpy.random import randn

In [279]:
np.random.seed(101)

In [280]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [281]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Columns

In [282]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [283]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [284]:
type(df['W'])

pandas.core.series.Series

In [285]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [286]:
#df['new']

In [287]:
df['new'] = df['W'] + df['Z']

In [288]:
df['new']

A    3.210676
B    1.257083
C   -2.607169
D    1.143752
E    0.874303
Name: new, dtype: float64

In [289]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [290]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [291]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [292]:
df.drop('new',axis=1,inplace=True)

In [293]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [294]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [295]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [296]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [297]:
df.drop('E',axis=0,inplace=True)

In [298]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [299]:
# Selecting Rows

In [300]:
df.shape

(4, 4)

In [301]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [302]:
df.loc[['A','B']][['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [303]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [304]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [305]:
df.iloc[1] + df.iloc[2]

W   -1.367050
X    0.420804
Y   -0.319263
Z    0.016965
dtype: float64

In [306]:
df.iloc[1,2]

-0.8480769834036315

In [307]:
df.loc['B','Y']

-0.8480769834036315

In [308]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [309]:
df.loc[['A','B']][['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [310]:
type(df.loc[['A','B'],['W','X']])

pandas.core.frame.DataFrame

In [311]:
type(df.loc[['A','B']][['W','X']])

pandas.core.frame.DataFrame

# DataFrames Part II

In [312]:
import numpy as np
import pandas as pd

In [313]:
from numpy.random import randn

In [314]:
np.random.seed(101)

In [315]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [316]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [317]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [318]:
df < 0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [319]:
df == 0

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [320]:
booldf_gt = df > 0

In [321]:
df[booldf_gt]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [322]:
booldf_lt = df <  0

In [323]:
df[booldf_lt]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [324]:
booldf_gt & booldf_lt

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [325]:
booldf_gt | booldf_lt

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [326]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [327]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [328]:
result_df = df[df['Z']<0]

In [329]:
result_df

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [330]:
result_df['W']

C   -2.018168
Name: W, dtype: float64

In [331]:
df[df['Z']<0]['W']

C   -2.018168
Name: W, dtype: float64

In [332]:
df[df['Z']<0][['W','X']]

          W         X
C -2.018168  0.740122

In [333]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [334]:
df[(df['W']>0) | (df['X']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [335]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [336]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [337]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [338]:
df.reset_index(inplace=True)

In [339]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [340]:
# index reset removed

In [341]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [342]:
new_indx = 'NY CA TX NC FL'.split()

In [343]:
new_indx

['NY', 'CA', 'TX', 'NC', 'FL']

In [344]:
df['States'] = new_indx

In [345]:
df['States']

0    NY
1    CA
2    TX
3    NC
4    FL
Name: States, dtype: object

In [346]:
# new column added to DataFrame - 'States'

In [347]:
df

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     NY
1     B  0.651118 -0.319318 -0.848077  0.605965     CA
2     C -2.018168  0.740122  0.528813 -0.589001     TX
3     D  0.188695 -0.758872 -0.933237  0.955057     NC
4     E  0.190794  1.978757  2.605967  0.683509     FL

In [348]:
df.set_index('States')

       index         W         X         Y         Z
States
NY         A  2.706850  0.628133  0.907969  0.503826
CA         B  0.651118 -0.319318 -0.848077  0.605965
TX         C -2.018168  0.740122  0.528813 -0.589001
NC         D  0.188695 -0.758872 -0.933237  0.955057
FL         E  0.190794  1.978757  2.605967  0.683509

# DataFrames  Part III

In [349]:
import numpy as np
import pandas as pd

In [350]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [351]:
mod_index = list(zip(outside,inside))

In [352]:
mod_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [353]:
mod_index = pd.MultiIndex.from_tuples(mod_index)

In [354]:
mod_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [355]:
type(mod_index)

pandas.core.indexes.multi.MultiIndex

In [356]:
df = pd.DataFrame(randn(6,2),mod_index,['A','B'])

In [357]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [358]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [359]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [360]:
df.iloc[0]

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [361]:
df.iloc[1]

A   -1.706086
B   -1.159119
Name: (G1, 2), dtype: float64

In [362]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [363]:
df.loc['G1'].iloc[1]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [364]:
df.loc['G1'].iloc[0]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [365]:
df.index.names

FrozenList([None, None])

In [366]:
df.index.names = ['Groups', 'Num']

In [367]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [368]:
df.loc['G2'].loc[2,'B']

0.07295967531703869

In [369]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [370]:
df.loc['G1'].loc[3]['B']

0.39052784273374097

In [371]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [372]:
df.xs('G2')

            A         B
Num
1    0.166905  0.184502
2    0.807706  0.072960
3    0.638787  0.329646

In [373]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [374]:
df.xs(2,level='Num')

               A         B
Groups
G1     -1.706086 -1.159119
G2      0.807706  0.072960

In [375]:
df.xs(3,level='Num')

               A         B
Groups
G1     -0.134841  0.390528
G2      0.638787  0.329646

# Missing Data

In [376]:
import numpy as np
import pandas as pd

In [377]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[6,7,8]}

In [378]:
type(d)

dict

In [379]:
df = pd.DataFrame(d)

In [380]:
df

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [381]:
df.dropna()

     A    B  C
0  1.0  5.0  6

In [382]:
df.dropna(axis=1)

   C
0  6
1  7
2  8

In [383]:
# default axis = 0 (rows)
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  6

In [384]:
df

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [385]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7

In [386]:
df.fillna(value='NA')

    A   B  C
0   1   5  6
1   2  NA  7
2  NA  NA  8

In [387]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [388]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [389]:
df['B']

0    5.0
1    NaN
2    NaN
Name: B, dtype: float64

In [390]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [391]:
df['C']

0    6
1    7
2    8
Name: C, dtype: int64

# Groupby

In [392]:
import numpy as np
import pandas as pd

In [393]:
sales_data = {'Team':['Mercedes AMG Petronas','Mercedes AMG Petronas','Scuderia Ferrari','Scuderia Ferrari',
                      'Red Bull Racing','Red Bull Racing'],
             'Driver':['Lewis Hamilton','Valtteri Bottas','Sebastian Vettel','Charles Leclerc',
                       'Max Verstappen','Alex Albon'],
             'Revenue':[900,800,900,800,900,800]}

In [394]:
sales_df = pd.DataFrame(sales_data)

In [395]:
sales_df

                    Team            Driver  Revenue
0  Mercedes AMG Petronas    Lewis Hamilton      900
1  Mercedes AMG Petronas   Valtteri Bottas      800
2       Scuderia Ferrari  Sebastian Vettel      900
3       Scuderia Ferrari   Charles Leclerc      800
4        Red Bull Racing    Max Verstappen      900
5        Red Bull Racing        Alex Albon      800

In [396]:
f1_team = sales_df.groupby('Team')

In [397]:
f1_team.mean()

                       Revenue
Team
Mercedes AMG Petronas      850
Red Bull Racing            850
Scuderia Ferrari           850

In [398]:
f1_team.sum()

                       Revenue
Team
Mercedes AMG Petronas     1700
Red Bull Racing           1700
Scuderia Ferrari          1700

In [399]:
f1_team.std()

                         Revenue
Team
Mercedes AMG Petronas  70.710678
Red Bull Racing        70.710678
Scuderia Ferrari       70.710678

In [400]:
f1_team.sum().loc['Red Bull Racing']

Revenue    1700
Name: Red Bull Racing, dtype: int64

In [401]:
sales_df.groupby('Team').sum().loc['Red Bull Racing']

Revenue    1700
Name: Red Bull Racing, dtype: int64

In [402]:
sales_df.groupby('Team').describe()

                      Revenue                                                \
                        count   mean        std    min    25%    50%    75%
Team
Mercedes AMG Petronas     2.0  850.0  70.710678  800.0  825.0  850.0  875.0
Red Bull Racing           2.0  850.0  70.710678  800.0  825.0  850.0  875.0
Scuderia Ferrari          2.0  850.0  70.710678  800.0  825.0  850.0  875.0


                         max
Team
Mercedes AMG Petronas  900.0
Red Bull Racing        900.0
Scuderia Ferrari       900.0

In [403]:
sales_df.groupby('Team').describe().transpose()

Team           Mercedes AMG Petronas  Red Bull Racing  Scuderia Ferrari
Revenue count               2.000000         2.000000          2.000000
        mean              850.000000       850.000000        850.000000
        std                70.710678        70.710678         70.710678
        min               800.000000       800.000000        800.000000
        25%               825.000000       825.000000        825.000000
        50%               850.000000       850.000000        850.000000
        75%               875.000000       875.000000        875.000000
        max               900.000000       900.000000        900.000000

In [404]:
sales_df.groupby('Team').describe().transpose()['Mercedes AMG Petronas']

Revenue  count      2.000000
         mean     850.000000
         std       70.710678
         min      800.000000
         25%      825.000000
         50%      850.000000
         75%      875.000000
         max      900.000000
Name: Mercedes AMG Petronas, dtype: float64

In [405]:
import numpy as np
import pandas as pd

In [406]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']}, index=[0,1,2,3])

In [407]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']}, index=[4,5,6,7])

In [408]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']}, index=[8,9,10,11])

In [409]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [410]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [411]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation

In [412]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [413]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Example DataFrames

In [414]:
import pandas as pd

In [415]:
left_df = pd.DataFrame( {'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']} )

In [416]:
right_df = pd.DataFrame( {'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']} )

In [417]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [418]:
right_df

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# Merge

In [419]:
pd.merge(left_df,right_df,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [420]:
left_df1 = pd.DataFrame( {'key1':['K0','K0','K1','K2'],'key2':['K0','K1','K0','K1'],
                         'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']} )

In [421]:
right_df1 = pd.DataFrame( {'key1':['K0','K1','K1','K2'],'key2':['K0','K0','K0','K0'],
                           'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']} )

In [422]:
pd.merge(left_df1,right_df1,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [423]:
pd.merge(left_df1,right_df1,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [424]:
pd.merge(left_df1,right_df1,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [425]:
pd.merge(left_df1,right_df1,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [426]:
pd.merge(left_df1,right_df1,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining

In [427]:
left_df2 = pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']}, index=['K0','K1','K2'])

In [428]:
right_df2 = pd.DataFrame({'C':['C0','C1','C2'],'D':['D0','D1','D2']}, index=['K0','K2','K3'])

In [429]:
left_df2.join(right_df2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [430]:
right_df2.join(left_df2)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C1  D1   A2   B2
K3  C2  D2  NaN  NaN

In [431]:
left_df2.join(right_df2,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [432]:
left_df2.join(right_df2,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C1  D1

In [433]:
left_df2.join(right_df2,how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [434]:
left_df2.join(right_df2,how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C1  D1
K3  NaN  NaN  C2  D2

# Pandas - Operations

In [435]:
import numpy as np

In [436]:
import pandas as pd

In [437]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,777,444],'col3':['abc','def','ghi','xyz']})

In [438]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [439]:
df['col2'].unique()

array([444, 555, 777], dtype=int64)

In [440]:
len(df['col2'].unique())

3

In [441]:
df['col2'].nunique()

3

In [442]:
df['col2'].value_counts()

444    2
555    1
777    1
Name: col2, dtype: int64

In [443]:
df[df['col1']>2]

   col1  col2 col3
2     3   777  ghi
3     4   444  xyz

In [444]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [445]:
df[ ( df['col1']>2 ) & ( df['col2'] > 555 )]

   col1  col2 col3
2     3   777  ghi

In [446]:
def times2(x):
    return x*2

In [447]:
df['col2'].apply(times2)

0     888
1    1110
2    1554
3     888
Name: col2, dtype: int64

In [448]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1554
3     888
Name: col2, dtype: int64

In [449]:
df['col3'].apply(lambda x:x[::-1])

0    cba
1    fed
2    ihg
3    zyx
Name: col3, dtype: object

In [450]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [451]:
df['col2'].apply(hex)

0    0x1bc
1    0x22b
2    0x309
3    0x1bc
Name: col2, dtype: object

In [452]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   777  ghi
3     4   444  xyz

In [453]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   777  ghi
3   444  xyz

In [454]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [455]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [456]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   777  ghi

In [457]:
df.sort_values(by='col2', kind='quicksort')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   777  ghi

In [458]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [459]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]
       }

df = pd.DataFrame(data)

In [460]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [461]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input Output

### . CSV
### . Excel
### . HTML
### . SQL

In [505]:
# Working with CSV's

In [493]:
import pandas as pd

In [494]:
pd.read_csv('example.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [495]:
df = pd.read_csv('example.csv')

In [496]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [503]:
# index=False to avoid Unnamed: 0 column being added in resulting dataframe
df.to_csv('my_output.csv',index=False)

In [511]:
pd.read_csv('my_output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [506]:
# Working with Excel Sheets

In [517]:
excel_df = pd.read_excel('excel_sample.xlsx',index=False,sheet_name='Sheet1',index_col=0)

In [518]:
excel_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [519]:
excel_df.to_excel('excel_output.xlsx',sheet_name='NewSheet')

In [523]:
pd.read_excel('excel_output.xlsx',sheet_name='NewSheet',index=False,index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [524]:
# Working with HTML

In [533]:
html_data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html')

In [534]:
html_data

[                             Bank Name               City  ST   CERT  \
 0           First City Bank of Florida  Fort Walton Beach  FL  16748
 1                 The First State Bank      Barboursville  WV  14361
 2                   Ericson State Bank            Ericson  NE  18265
 3     City National Bank of New Jersey             Newark  NJ  21111
 4                        Resolute Bank             Maumee  OH  58317
 ..                                 ...                ...  ..    ...
 557                 Superior Bank, FSB           Hinsdale  IL  32646
 558                Malta National Bank              Malta  OH   6629
 559    First Alliance Bank & Trust Co.         Manchester  NH  34264
 560  National State Bank of Metropolis         Metropolis  IL   3815
 561                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0              United Fidelity Bank, fsb   October 16, 2020
 1                         MVB Bank, Inc.      April 3, 2020
 2             Farmers and Merchants Bank  February 14, 2020
 3                        Industrial Bank   November 1, 2019
 4                     Buckeye State Bank   October 25, 2019
 ..                                   ...                ...
 557                Superior Federal, FSB      July 27, 2001
 558                    North Valley Bank        May 3, 2001
 559  Southern New Hampshire Bank & Trust   February 2, 2001
 560              Banterra Bank of Marion  December 14, 2000
 561                   Bank of the Orient   October 13, 2000

 [562 rows x 6 columns]]

In [535]:
type(html_data)

list

In [536]:
type(html_data[0])

pandas.core.frame.DataFrame

In [565]:
html_data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
1,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
2,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
3,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
4,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
...,...,...,...,...,...,...
557,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
558,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
559,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
560,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
561,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [540]:
len(html_data[0])

562

In [566]:
html_data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
1,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
2,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
3,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
4,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"

In [567]:
html_data[0].tail()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
557,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
558,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
559,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
560,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
561,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [568]:
# Working with SQL

In [569]:
from sqlalchemy import create_engine

In [571]:
engine = create_engine('sqlite:///:memory:')

In [572]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [573]:
df.to_sql('my_table',engine)

In [574]:
sql_df = pd.read_sql('my_table',con=engine)

In [575]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15